USE CouriersDB
GO

CREATE TABLE DispatchersTest (
    FullName VARCHAR(50),
    PhoneNumber varchar(10)
);
INSERT INTO dbo.DispatchersTest VALUES
    ('Асен Донев',0887897555),
    ('Асен Донев',0887897555),
    ('Колю Колев',0888987555),
    ('Маша Малишкина',0881122678),
    ('Маша Малишкина',0881122678),
    ('Асен Донев',0887897555),
    ('Маша Малишкина',0881122678),
    ('Маша Малишкина',0881122678),
    ('Петър Петров',0882898666),
    ('Теа Иванова',0883567555),
    ('Теа Иванова',0883567555),
    ('Петър Петров',0882898666),
    ('Колю Колев',0888987555),
    ('Колю Колев',0888987555),
    ('Тодор Стоев',0889978555),
    ('Теа Иванова',0883567555),
    ('Маша Малишкина',0881122678),
    ('Колю Колев',0888987555),
    ('Тодор Стоев',0889978555),
    ('Колю Колев',0888987555),
    ('Тодор Стоев',0889978555),
    ('Тодор Стоев',0889978555),
    ('Асен Донев',0887897555),
    ('Тодор Стоев',0889978555),
    ('Тодор Стоев',0889978555),
    ('Тодор Стоев',0889978555),
    ('Асен Донев',0887897555),
    ('Асен Донев',0887897555),
    ('Петър Петров',0882898666),
    ('Теа Иванова',0883567555),
    ('Маша Малишкина',0881122678),
    ('Теа Иванова',0883567555),
    ('Колю Колев',0888987555),
    ('Петър Петров',0882898666),
    ('Колю Колев',0888987555),
    ('Петър Петров',0882898666);

INSERT INTO Dispatchers
	SELECT DISTINCT
		SUBSTRING(FullName,1,CHARINDEX(' ',FullName)-1),
		SUBSTRING(FullName,CHARINDEX(' ',FullName)+1,len(FullName)),
		'0' + PhoneNumber
	FROM DispatchersTest
	WHERE NOT EXISTS ( SELECT * FROM Dispatchers WHERE FirstName + ' ' + LastName = FullName )