use master
go

drop database CouriersDB
go

CREATE DATABASE CouriersDB
COLLATE Cyrillic_General_CI_AS
GO

USE CouriersDB;
GO

CREATE TABLE [Clients] (
	ID int identity(1, 1) NOT NULL,
	Name varchar(50) NOT NULL,
	PhoneNumber varchar(10) NOT NULL,
	CONSTRAINT [PK_CLIENTS] PRIMARY KEY CLUSTERED (
		[ID] ASC
	) WITH (IGNORE_DUP_KEY = OFF),
	unique(Name, PhoneNumber)
)
GO

CREATE TABLE [Dispatchers] (
	ID int identity(1, 1) NOT NULL,
	Name varchar(50) NOT NULL,
	PhoneNumber varchar(10) NOT NULL,
	CONSTRAINT [PK_DISPATCHERS] PRIMARY KEY CLUSTERED (
		[ID] ASC
	) WITH (IGNORE_DUP_KEY = OFF),
	unique(Name, PhoneNumber)
)
GO
CREATE TABLE [Couriers] (
	ID int identity(1, 1) NOT NULL,
	Name varchar(50) NOT NULL,
	PhoneNumber varchar(10) NOT NULL,
	CONSTRAINT [PK_COURIERS] PRIMARY KEY CLUSTERED (
		[ID] ASC
	) WITH (IGNORE_DUP_KEY = OFF),
	unique(Name, PhoneNumber)
)
GO

CREATE TABLE [Orders] (
	ID int identity(1, 1) NOT NULL,
	OrderDate date NOT NULL,
	ReceiveDate date NOT NULL,
	Total money NOT NULL,
	AddressID int NOT NULL,
	TypeID int NOT NULL,
	DispatcherID int NOT NULL,
	ClientID int NOT NULL foreign key references Clients(ID),
	CourierID int NOT NULL,
	RecipientID int NOT NULL,
	CONSTRAINT [PK_ORDERS] PRIMARY KEY CLUSTERED (
		[ID] ASC
	) WITH (IGNORE_DUP_KEY = OFF)
)
GO
CREATE TABLE [Recipients] (
	ID int identity(1, 1) NOT NULL,
	Name varchar(50) UNIQUE NOT NULL,
	CONSTRAINT [PK_RECIPIENTS] PRIMARY KEY CLUSTERED (
		[ID] ASC
	) WITH (IGNORE_DUP_KEY = OFF)
)
GO

CREATE TABLE [TypesOfService] (
	ID int identity(1, 1) NOT NULL,
	Type varchar(50) unique NOT NULL,
	CONSTRAINT [PK_TYPESOFSERVICE] PRIMARY KEY CLUSTERED (
		[ID] ASC
	) WITH (IGNORE_DUP_KEY = OFF)
)
GO

CREATE TABLE [Addresses] (
	ID int identity(1, 1) NOT NULL,
	Address varchar(100) unique NOT NULL,
	CONSTRAINT [PK_ADDRESSES] PRIMARY KEY CLUSTERED (
		[ID] ASC
	) WITH (IGNORE_DUP_KEY = OFF)
)
GO

ALTER TABLE [Orders] WITH CHECK ADD CONSTRAINT [Orders_fk0] FOREIGN KEY ([AddressID]) REFERENCES [Addresses]([ID])
ON UPDATE CASCADE
GO
ALTER TABLE [Orders] CHECK CONSTRAINT [Orders_fk0]
GO
ALTER TABLE [Orders] WITH CHECK ADD CONSTRAINT [Orders_fk1] FOREIGN KEY ([TypeID]) REFERENCES [TypesOfService]([ID])
ON UPDATE CASCADE
GO
ALTER TABLE [Orders] CHECK CONSTRAINT [Orders_fk1]
GO
ALTER TABLE [Orders] WITH CHECK ADD CONSTRAINT [Orders_fk2] FOREIGN KEY ([DispatcherID]) REFERENCES [Dispatchers]([ID])
ON UPDATE CASCADE
GO
ALTER TABLE [Orders] CHECK CONSTRAINT [Orders_fk2]
GO
ALTER TABLE [Orders] WITH CHECK ADD CONSTRAINT [Orders_fk3] FOREIGN KEY ([ClientID]) REFERENCES [Clients]([ID])
ON UPDATE CASCADE
GO
ALTER TABLE [Orders] CHECK CONSTRAINT [Orders_fk3]
GO
ALTER TABLE [Orders] WITH CHECK ADD CONSTRAINT [Orders_fk4] FOREIGN KEY ([CourierID]) REFERENCES [Couriers]([ID])
ON UPDATE CASCADE
GO
ALTER TABLE [Orders] CHECK CONSTRAINT [Orders_fk4]
GO
ALTER TABLE [Orders] WITH CHECK ADD CONSTRAINT [Orders_fk5] FOREIGN KEY ([RecipientID]) REFERENCES [Recipients]([ID])
ON UPDATE CASCADE
GO
ALTER TABLE [Orders] CHECK CONSTRAINT [Orders_fk5]
GO

CREATE TABLE Couriers_Names_Phones_Temp (
    Name VARCHAR(50),
    PhoneNumber VARCHAR(10)
);
INSERT INTO Couriers_Names_Phones_Temp VALUES
    ('Димана Донева',0876555555),
    ('Камен Каменов',0876555111),
    ('Мони Иванова',0876555222),
    ('Димана Донева',0876555555),
    ('Петър Иванов',0876555777),
    ('Петър Иванов',0876555777),
    ('Силвия Бонева',0876555666),
    ('Синтия Гочева',0876555888),
    ('Мони Иванова',0876555222),
    ('Петър Иванов',0876555777),
    ('Таня Руменова',0876555444),
    ('Калина Минкова',0876555333),
    ('Камен Каменов',0876555111),
    ('Димана Донева',0876555555),
    ('Силвия Бонева',0876555666),
    ('Мони Иванова',0876555222),
    ('Силвия Бонева',0876555666),
    ('Таня Руменова',0876555444),
    ('Синтия Гочева',0876555888),
    ('Петър Иванов',0876555777),
    ('Синтия Гочева',0876555888),
    ('Таня Руменова',0876555444),
    ('Калина Минкова',0876555333),
    ('Мони Иванова',0876555222),
    ('Калина Минкова',0876555333),
    ('Силвия Бонева',0876555666),
    ('Силвия Бонева',0876555666),
    ('Таня Руменова',0876555444),
    ('Димана Донева',0876555555),
    ('Силвия Бонева',0876555666),
    ('Калина Минкова',0876555333),
    ('Камен Каменов',0876555111),
    ('Мони Иванова',0876555222),
    ('Силвия Бонева',0876555666),
    ('Камен Каменов',0876555111),
    ('Камен Каменов',0876555111);
INSERT INTO Couriers
SELECT DISTINCT Name, '0' + PhoneNumber FROM Couriers_Names_Phones_Temp;
GO

DROP TABLE Couriers_Names_Phones_Temp;
GO

CREATE TABLE Clients_Temp (
    Name VARCHAR(50),
    PhoneNumber VARCHAR(10)
);
INSERT INTO Clients_Temp VALUES
    ('Галин Христов',0888555111),
    ('Джим Шон',0888555222),
    ('Джим Шон',0888555222),
    ('Галин Христов',0888555111),
    ('Борис Зарев',0889777555),
    ('Борис Зарев',0889777555),
    ('Румен Огнянов',0888555788),
    ('Милен Галев',0887555777),
    ('Христо Христов',0889555123),
    ('Милен Галев',0887555777),
    ('Орлин Балев',0889123121),
    ('Христо Христов',0889555123),
    ('Араам Безисян',0823555444),
    ('Нено Ненов',0888555666),
    ('Шон Петерсон',0881555111),
    ('Христо Христов',0889555123),
    ('Шон Петерсон',0881555111),
    ('Стамен Киров',0883555246),
    ('Нено Ненов',0888555666),
    ('Шон Петерсон',0881555111),
    ('Стамен Киров',0883555246),
    ('Филип Филипов',0888555333),
    ('Христо Христов',0889555123),
    ('Севинч Халилова',0888999567),
    ('Нено Ненов',0888555666),
    ('Светлин Манев',0889245543),
    ('Светлин Манев',0889245543),
    ('Нено Ненов',0888555666),
    ('Нено Ненов',0888555666),
    ('Светлин Манев',0889245543),
    ('Кирил Занев',0888666111),
    ('Нено Ненов',0888555666),
    ('Нено Ненов',0888555666),
    ('Светлин Манев',0889245543),
    ('Христо Иванов',0777555111),
    ('Христо Иванов',0777555111);
INSERT INTO Clients
SELECT DISTINCT Name, '0' + PhoneNumber FROM Clients_Temp;
GO

DROP TABLE Clients_Temp;
GO

CREATE TABLE Dispatchers_Temp (
    Name VARCHAR(50),
    PhoneNumber VARCHAR(10)
);
INSERT INTO Dispatchers_Temp VALUES
    ('Асен Донев',0887897555),
    ('Асен Донев',0887897555),
    ('Колю Колев',0888987555),
    ('Маша Малишкина',0881122678),
    ('Маша Малишкина',0881122678),
    ('Асен Донев',0887897555),
    ('Маша Малишкина',0881122678),
    ('Маша Малишкина',0881122678),
    ('Петър Петров',0882898666),
    ('Теа Иванова',0883567555),
    ('Теа Иванова',0883567555),
    ('Петър Петров',0882898666),
    ('Колю Колев',0888987555),
    ('Колю Колев',0888987555),
    ('Тодор Стоев',0889978555),
    ('Теа Иванова',0883567555),
    ('Маша Малишкина',0881122678),
    ('Колю Колев',0888987555),
    ('Тодор Стоев',0889978555),
    ('Колю Колев',0888987555),
    ('Тодор Стоев',0889978555),
    ('Тодор Стоев',0889978555),
    ('Асен Донев',0887897555),
    ('Тодор Стоев',0889978555),
    ('Тодор Стоев',0889978555),
    ('Тодор Стоев',0889978555),
    ('Асен Донев',0887897555),
    ('Асен Донев',0887897555),
    ('Петър Петров',0882898666),
    ('Теа Иванова',0883567555),
    ('Маша Малишкина',0881122678),
    ('Теа Иванова',0883567555),
    ('Колю Колев',0888987555),
    ('Петър Петров',0882898666),
    ('Колю Колев',0888987555),
    ('Петър Петров',0882898666);
INSERT INTO Dispatchers
SELECT DISTINCT Name, '0' + PhoneNumber FROM Dispatchers_Temp;
GO

DROP TABLE Dispatchers_Temp;
GO

CREATE TABLE Addresses_Temp(
    Address VARCHAR(50)
);
INSERT INTO dbo.Addresses_Temp VALUES
    ('ул. Бреза 9'),
    ('ул. Александър Кръстев 22'),
    ('ул. Вардар 8'),
    ('ул. Бук 18'),
    ('ул. Здравко Чакъров 100'),
    ('ул. Здравко Чакъров 100'),
    ('ул. Иван Вазов 24'),
    ('ул. Дрин 66'),
    ('ул. Блян, бл. 56'),
    ('ул. Дрин 66'),
    ('ул. Жеравна 120'),
    ('ул. Блян, бл. 56'),
    ('ул. Емануил Поптодоров 20'),
    ('ул. Драгаш 56'),
    ('ул. Ивайло 15'),
    ('ул. Блян, бл. 56'),
    ('ул. Ивайло 15'),
    ('ул. Блян, бл. 65'),
    ('ул. Емил Гаванаков 25'),
    ('ул. Ивайло 15'),
    ('ул. Блян, бл. 65'),
    ('ул. Емил Гаванаков 5'),
    ('ул. Блян, бл. 56'),
    ('ул. Иван Янев 65'),
    ('ул. Лебед 7'),
    ('ул. Иван Троянски 22'),
    ('ул. Иван Владиков 23'),
    ('ул. Дядо Димитър 16'),
    ('ул. Дядо Димитър 16'),
    ('ул. Иван Троянски 22'),
    ('ул. Зограф 6'),
    ('ул. Лебед 7'),
    ('ул. Дядо Димитър 16'),
    ('ул. Иван Троянски 22'),
    ('ул. Божур 9'),
    ('ул. Божур 9');
INSERT INTO Addresses
SELECT DISTINCT Address FROM Addresses_Temp;
GO

DROP TABLE Addresses_Temp;
GO

CREATE TABLE Recipients_Temp (
    Name VARCHAR(50)
);
INSERT INTO Recipients_Temp VALUES
    ('Галена Халиева'),
    ('Шон Джим'),
    ('Шон Джим'),
    ('Христо Галев'),
    ('Зарко Борисов'),
    ('Зарко Борисов'),
    ('Огнян Руменов'),
    ('Петко Петков'),
    ('Сиси Бонева'),
    ('Петко Петков'),
    ('Васил Ставрев'),
    ('Харалампи Харалампиев'),
    ('Безис Абрамян'),
    ('Драган Драганов'),
    ('Лиляна Павлова'),
    ('Христина Христова'),
    ('Лиляна Павлова'),
    ('Стефан Колев'),
    ('Емилия Попова'),
    ('Лиляна Павлова'),
    ('Стефан Колев'),
    ('Филип Филипополов'),
    ('Харалампи Харалампиев'),
    ('Хамид Хамид'),
    ('Тино Ненов'),
    ('Иван Троянов'),
    ('Иван Василев'),
    ('Димитър Димитров'),
    ('Димитър Димитров'),
    ('Иван Троянов'),
    ('Борислава Борисова'),
    ('Тино Ненов'),
    ('Ненчо Ненов'),
    ('Ива Иванова'),
    ('Иван Христов'),
    ('Иван Христов');
INSERT INTO Recipients
SELECT DISTINCT Name FROM Recipients_Temp;
GO

DROP TABLE Recipients_Temp;
GO

CREATE TABLE TypesOfService_Temp (
    ToS VARCHAR(50)
);
INSERT INTO TypesOfService_Temp VALUES
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка над 10 до 15 кг'),
    ('Колетна пратка над 10 до 15 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 5 до 10 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 10 до 15 кг'),
    ('Колетна пратка над 10 до 15 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 10 до 15 кг'),
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка над 5 до 10 кг'),
    ('Колетна пратка над 5 до 10 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 5 до 10 кг'),
    ('Колетна пратка над 10 до 15 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка над 5 до 10 кг'),
    ('Колетна пратка над 10 до 15 кг'),
    ('Колетна пратка над 5 до 10 кг'),
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка над 5 до 10 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 5 до 10 кг'),
    ('Колетна пратка над 10 до 15 кг'),
    ('Колетна пратка над 2 до 5 кг');
INSERT INTO TypesOfService
SELECT DISTINCT ToS FROM TypesOfService_Temp;
GO

DROP TABLE TypesOfService_Temp;
GO

CREATE TABLE Orders_Temp (
    ID INT IDENTITY(1,1),
    OrderDate DATETIME,
    Disp_Name VARCHAR(50),
    Disp_PN VARCHAR(10),
    Client_Name VARCHAR(50),
    Client_PN VARCHAR(10),
    ToS VARCHAR(50),
    Total Money,
    Cour_Name VARCHAR(50),
    Cour_PN VARCHAR(10),
    Address VARCHAR(50),
    Recip_Name VARCHAR(50),
    RecieveDate DATETIME
);
INSERT INTO Orders_Temp VALUES
    ('2021-08-16 00:00:00','Асен Донев',0887897555,'Галин Христов',0888555111,'Колетна пратка над 2 до 5 кг',6.72,'Димана Донева',0876555555,'ул. Бреза 9','Галена Халиева',CONVERT(DATETIME, '20.8.2021', 104)),
    ('2021-09-09 00:00:00','Асен Донев',0887897555,'Джим Шон',0888555222,'Колетна пратка до 2 кг',6,'Камен Каменов',0876555111,'ул. Александър Кръстев 22','Шон Джим',CONVERT(DATETIME, '15.9.2021', 104)),
    ('2021-09-09 00:00:00','Колю Колев',0888987555,'Джим Шон',0888555222,'Колетна пратка над 2 до 5 кг',6.72,'Мони Иванова',0876555222,'ул. Вардар 8','Шон Джим',CONVERT(DATETIME, '15.9.2021', 104)),
    ('2021-09-14 00:00:00','Маша Малишкина',0881122678,'Галин Христов',0888555111,'Колетна пратка над 2 до 5 кг',6.72,'Димана Донева',0876555555,'ул. Бук 18','Христо Галев',CONVERT(DATETIME, '17.9.2021', 104)),
    ('2021-09-15 00:00:00','Маша Малишкина',0881122678,'Борис Зарев',0889777555,'Колетна пратка над 10 до 15 кг',12.1,'Петър Иванов',0876555777,'ул. Здравко Чакъров 100','Зарко Борисов',CONVERT(DATETIME, '21.9.2021', 104)),
    ('2021-09-17 00:00:00','Асен Донев',0887897555,'Борис Зарев',0889777555,'Колетна пратка над 10 до 15 кг',12.1,'Петър Иванов',0876555777,'ул. Здравко Чакъров 100','Зарко Борисов',CONVERT(DATETIME, '23.9.2021', 104)),
    ('2021-09-22 00:00:00','Маша Малишкина',0881122678,'Румен Огнянов',0888555788,'Колетна пратка до 2 кг',6,'Силвия Бонева',0876555666,'ул. Иван Вазов 24','Огнян Руменов',CONVERT(DATETIME, '27.9.2021', 104)),
    ('2021-10-13 00:00:00','Маша Малишкина',0881122678,'Милен Галев',0887555777,'Колетна пратка над 5 до 10 кг',10.75,'Синтия Гочева',0876555888,'ул. Дрин 66','Петко Петков',CONVERT(DATETIME, '19.10.2021', 104)),
    ('2021-10-15 00:00:00','Петър Петров',0882898666,'Христо Христов',0889555123,'Колетна пратка до 2 кг',6,'Мони Иванова',0876555222,'ул. Блян, бл. 56','Сиси Бонева',CONVERT(DATETIME, '20.10.2021', 104)),
    ('2021-10-28 00:00:00','Теа Иванова',0883567555,'Милен Галев',0887555777,'Колетна пратка над 10 до 15 кг',12.1,'Петър Иванов',0876555777,'ул. Дрин 66','Петко Петков',CONVERT(DATETIME, '2.11.2021', 104)),
    ('2021-11-01 00:00:00','Теа Иванова',0883567555,'Орлин Балев',0889123121,'Колетна пратка над 10 до 15 кг',12.1,'Таня Руменова',0876555444,'ул. Жеравна 120','Васил Ставрев',CONVERT(DATETIME, '5.11.2021', 104)),
    ('2021-11-04 00:00:00','Петър Петров',0882898666,'Христо Христов',0889555123,'Колетна пратка до 2 кг',6,'Калина Минкова',0876555333,'ул. Блян, бл. 56','Харалампи Харалампиев',CONVERT(DATETIME, '10.11.2021', 104)),
    ('2021-11-08 00:00:00','Колю Колев',0888987555,'Араам Безисян',0823555444,'Колетна пратка над 2 до 5 кг',6.72,'Камен Каменов',0876555111,'ул. Емануил Поптодоров 20','Безис Абрамян',CONVERT(DATETIME, '12.11.2021', 104)),
    ('2021-11-16 00:00:00','Колю Колев',0888987555,'Нено Ненов',0888555666,'Колетна пратка до 2 кг',6,'Димана Донева',0876555555,'ул. Драгаш 56','Драган Драганов',CONVERT(DATETIME, '22.11.2021', 104)),
    ('2021-11-16 00:00:00','Тодор Стоев',0889978555,'Шон Петерсон',0881555111,'Колетна пратка над 10 до 15 кг',12.1,'Силвия Бонева',0876555666,'ул. Ивайло 15','Лиляна Павлова',CONVERT(DATETIME, '22.11.2021', 104)),
    ('2021-11-17 00:00:00','Теа Иванова',0883567555,'Христо Христов',0889555123,'Колетна пратка над 2 до 5 кг',6.72,'Мони Иванова',0876555222,'ул. Блян, бл. 56','Христина Христова',CONVERT(DATETIME, '23.11.2021', 104)),
    ('2021-11-17 00:00:00','Маша Малишкина',0881122678,'Шон Петерсон',0881555111,'Колетна пратка над 5 до 10 кг',10.75,'Силвия Бонева',0876555666,'ул. Ивайло 15','Лиляна Павлова',CONVERT(DATETIME, '23.11.2021', 104)),
    ('2021-11-22 00:00:00','Колю Колев',0888987555,'Стамен Киров',0883555246,'Колетна пратка над 5 до 10 кг',10.75,'Таня Руменова',0876555444,'ул. Блян, бл. 65','Стефан Колев',CONVERT(DATETIME, '26.11.2021', 104)),
    ('2021-11-24 00:00:00','Тодор Стоев',0889978555,'Нено Ненов',0888555666,'Колетна пратка до 2 кг',6,'Синтия Гочева',0876555888,'ул. Емил Гаванаков 25','Емилия Попова',CONVERT(DATETIME, '29.11.2021', 104)),
    ('2021-11-24 00:00:00','Колю Колев',0888987555,'Шон Петерсон',0881555111,'Колетна пратка до 2 кг',6,'Петър Иванов',0876555777,'ул. Ивайло 15','Лиляна Павлова',CONVERT(DATETIME, '30.11.2021', 104)),
    ('2021-11-30 00:00:00','Тодор Стоев',0889978555,'Стамен Киров',0883555246,'Колетна пратка над 5 до 10 кг',10.75,'Синтия Гочева',0876555888,'ул. Блян, бл. 65','Стефан Колев',CONVERT(DATETIME, '6.12.2021', 104)),
    ('2021-12-01 00:00:00','Тодор Стоев',0889978555,'Филип Филипов',0888555333,'Колетна пратка над 10 до 15 кг',12.1,'Таня Руменова',0876555444,'ул. Емил Гаванаков 5','Филип Филипополов',CONVERT(DATETIME, '6.12.2021', 104)),
    ('2021-12-07 00:00:00','Асен Донев',0887897555,'Христо Христов',0889555123,'Колетна пратка до 2 кг',6,'Калина Минкова',0876555333,'ул. Блян, бл. 56','Харалампи Харалампиев',CONVERT(DATETIME, '10.12.2021', 104)),
    ('2021-12-07 00:00:00','Тодор Стоев',0889978555,'Севинч Халилова',0888999567,'Колетна пратка над 2 до 5 кг',6.72,'Мони Иванова',0876555222,'ул. Иван Янев 65','Хамид Хамид',CONVERT(DATETIME, '10.12.2021', 104)),
    ('2021-12-08 00:00:00','Тодор Стоев',0889978555,'Нено Ненов',0888555666,'Колетна пратка над 2 до 5 кг',6.72,'Калина Минкова',0876555333,'ул. Лебед 7','Тино Ненов',CONVERT(DATETIME, '14.12.2021', 104)),
    ('2021-12-10 00:00:00','Тодор Стоев',0889978555,'Светлин Манев',0889245543,'Колетна пратка над 5 до 10 кг',10.75,'Силвия Бонева',0876555666,'ул. Иван Троянски 22','Иван Троянов',CONVERT(DATETIME, '15.12.2021', 104)),
    ('2021-12-13 00:00:00','Асен Донев',0887897555,'Светлин Манев',0889245543,'Колетна пратка над 10 до 15 кг',12.1,'Силвия Бонева',0876555666,'ул. Иван Владиков 23','Иван Василев',CONVERT(DATETIME, '17.12.2021', 104)),
    ('2021-12-15 00:00:00','Асен Донев',0887897555,'Нено Ненов',0888555666,'Колетна пратка над 5 до 10 кг',10.75,'Таня Руменова',0876555444,'ул. Дядо Димитър 16','Димитър Димитров',CONVERT(DATETIME, '21.12.2021', 104)),
    ('2021-12-17 00:00:00','Петър Петров',0882898666,'Нено Ненов',0888555666,'Колетна пратка над 2 до 5 кг',6.72,'Димана Донева',0876555555,'ул. Дядо Димитър 16','Димитър Димитров',CONVERT(DATETIME, '22.12.2021', 104)),
    ('2021-12-20 00:00:00','Теа Иванова',0883567555,'Светлин Манев',0889245543,'Колетна пратка до 2 кг',6,'Силвия Бонева',0876555666,'ул. Иван Троянски 22','Иван Троянов',CONVERT(DATETIME, '23.12.2021', 104)),
    ('2021-12-20 00:00:00','Маша Малишкина',0881122678,'Кирил Занев',0888666111,'Колетна пратка над 2 до 5 кг',6.72,'Калина Минкова',0876555333,'ул. Зограф 6','Борислава Борисова',CONVERT(DATETIME, '24.12.2021', 104)),
    ('2021-12-23 00:00:00','Теа Иванова',0883567555,'Нено Ненов',0888555666,'Колетна пратка над 5 до 10 кг',10.75,'Камен Каменов',0876555111,'ул. Лебед 7','Тино Ненов',CONVERT(DATETIME, '29.12.2021', 104)),
    ('2021-12-27 00:00:00','Колю Колев',0888987555,'Нено Ненов',0888555666,'Колетна пратка до 2 кг',6,'Мони Иванова',0876555222,'ул. Дядо Димитър 16','Ненчо Ненов',CONVERT(DATETIME, '31.12.2021', 104)),
    ('2021-12-27 00:00:00','Петър Петров',0882898666,'Светлин Манев',0889245543,'Колетна пратка над 5 до 10 кг',10.75,'Силвия Бонева',0876555666,'ул. Иван Троянски 22','Ива Иванова',CONVERT(DATETIME, '31.12.2021', 104)),
    ('2021-12-30 00:00:00','Колю Колев',0888987555,'Христо Иванов',0777555111,'Колетна пратка над 10 до 15 кг',12.1,'Камен Каменов',0876555111,'ул. Божур 9','Иван Христов',CONVERT(DATETIME, '5.1.2022', 104)),
    ('2021-12-31 00:00:00','Петър Петров',0882898666,'Христо Иванов',0777555111,'Колетна пратка над 2 до 5 кг',6.72,'Камен Каменов',0876555111,'ул. Божур 9','Иван Христов',CONVERT(DATETIME, '6.1.2022', 104));
INSERT INTO Orders
SELECT OrderDate, RecieveDate, Total,
	(SELECT ID
	FROM Addresses
	WHERE Addresses.Address = Orders_Temp.Address),
	(SELECT ID
	FROM TypesOfService
	WHERE TypesOfService.Type = Orders_Temp.ToS),
	(SELECT ID
	FROM Dispatchers
	WHERE Dispatchers.Name = Orders_Temp.Disp_Name AND Dispatchers.PhoneNumber = '0' + Orders_Temp.Disp_PN),
	(SELECT ID
	FROM Clients
	WHERE Clients.Name = Orders_Temp.Client_Name AND Clients.PhoneNumber = '0' + Orders_Temp.Client_PN),
	(SELECT ID
	FROM Couriers
	WHERE Couriers.Name = Orders_Temp.Cour_Name AND Couriers.PhoneNumber = '0' + Orders_Temp.Cour_PN),
	(SELECT ID
	FROM Recipients
	WHERE Recipients.Name = Orders_Temp.Recip_Name)
FROM Orders_Temp;
GO

DROP TABLE Orders_Temp;
GO
