use CouriersDB
go

CREATE TABLE Orders_Temp (
    ID INT IDENTITY(1,1),
    OrderDate DATETIME,
    Disp_Name VARCHAR(50),
    Disp_PN VARCHAR(10),
    Client_Name VARCHAR(50),
    Client_PN VARCHAR(10),
    ToS VARCHAR(50),
    Total Money,
    Cour_Name VARCHAR(50),
    Cour_PN VARCHAR(10),
    Address VARCHAR(50),
    Recip_Name VARCHAR(50),
    RecieveDate DATETIME
);
INSERT INTO Orders_Temp VALUES
    ('2021-08-16 00:00:00','Асен Донев',0887897555,'Галин Христов',0888555111,'Колетна пратка над 2 до 5 кг',6.72,'Димана Донева',0876555555,'ул. Бреза 9','Галена Халиева',CONVERT(DATETIME, '20.8.2021', 104)),
    ('2021-09-09 00:00:00','Асен Донев',0887897555,'Джим Шон',0888555222,'Колетна пратка до 2 кг',6,'Камен Каменов',0876555111,'ул. Александър Кръстев 22','Шон Джим',CONVERT(DATETIME, '15.9.2021', 104)),
    ('2021-09-09 00:00:00','Колю Колев',0888987555,'Джим Шон',0888555222,'Колетна пратка над 2 до 5 кг',6.72,'Мони Иванова',0876555222,'ул. Вардар 8','Шон Джим',CONVERT(DATETIME, '15.9.2021', 104)),
    ('2021-09-14 00:00:00','Маша Малишкина',0881122678,'Галин Христов',0888555111,'Колетна пратка над 2 до 5 кг',6.72,'Димана Донева',0876555555,'ул. Бук 18','Христо Галев',CONVERT(DATETIME, '17.9.2021', 104)),
    ('2021-09-15 00:00:00','Маша Малишкина',0881122678,'Борис Зарев',0889777555,'Колетна пратка над 10 до 15 кг',12.1,'Петър Иванов',0876555777,'ул. Здравко Чакъров 100','Зарко Борисов',CONVERT(DATETIME, '21.9.2021', 104)),
    ('2021-09-17 00:00:00','Асен Донев',0887897555,'Борис Зарев',0889777555,'Колетна пратка над 10 до 15 кг',12.1,'Петър Иванов',0876555777,'ул. Здравко Чакъров 100','Зарко Борисов',CONVERT(DATETIME, '23.9.2021', 104)),
    ('2021-09-22 00:00:00','Маша Малишкина',0881122678,'Румен Огнянов',0888555788,'Колетна пратка до 2 кг',6,'Силвия Бонева',0876555666,'ул. Иван Вазов 24','Огнян Руменов',CONVERT(DATETIME, '27.9.2021', 104)),
    ('2021-10-13 00:00:00','Маша Малишкина',0881122678,'Милен Галев',0887555777,'Колетна пратка над 5 до 10 кг',10.75,'Синтия Гочева',0876555888,'ул. Дрин 66','Петко Петков',CONVERT(DATETIME, '19.10.2021', 104)),
    ('2021-10-15 00:00:00','Петър Петров',0882898666,'Христо Христов',0889555123,'Колетна пратка до 2 кг',6,'Мони Иванова',0876555222,'ул. Блян, бл. 56','Сиси Бонева',CONVERT(DATETIME, '20.10.2021', 104)),
    ('2021-10-28 00:00:00','Теа Иванова',0883567555,'Милен Галев',0887555777,'Колетна пратка над 10 до 15 кг',12.1,'Петър Иванов',0876555777,'ул. Дрин 66','Петко Петков',CONVERT(DATETIME, '2.11.2021', 104)),
    ('2021-11-01 00:00:00','Теа Иванова',0883567555,'Орлин Балев',0889123121,'Колетна пратка над 10 до 15 кг',12.1,'Таня Руменова',0876555444,'ул. Жеравна 120','Васил Ставрев',CONVERT(DATETIME, '5.11.2021', 104)),
    ('2021-11-04 00:00:00','Петър Петров',0882898666,'Христо Христов',0889555123,'Колетна пратка до 2 кг',6,'Калина Минкова',0876555333,'ул. Блян, бл. 56','Харалампи Харалампиев',CONVERT(DATETIME, '10.11.2021', 104)),
    ('2021-11-08 00:00:00','Колю Колев',0888987555,'Араам Безисян',0823555444,'Колетна пратка над 2 до 5 кг',6.72,'Камен Каменов',0876555111,'ул. Емануил Поптодоров 20','Безис Абрамян',CONVERT(DATETIME, '12.11.2021', 104)),
    ('2021-11-16 00:00:00','Колю Колев',0888987555,'Нено Ненов',0888555666,'Колетна пратка до 2 кг',6,'Димана Донева',0876555555,'ул. Драгаш 56','Драган Драганов',CONVERT(DATETIME, '22.11.2021', 104)),
    ('2021-11-16 00:00:00','Тодор Стоев',0889978555,'Шон Петерсон',0881555111,'Колетна пратка над 10 до 15 кг',12.1,'Силвия Бонева',0876555666,'ул. Ивайло 15','Лиляна Павлова',CONVERT(DATETIME, '22.11.2021', 104)),
    ('2021-11-17 00:00:00','Теа Иванова',0883567555,'Христо Христов',0889555123,'Колетна пратка над 2 до 5 кг',6.72,'Мони Иванова',0876555222,'ул. Блян, бл. 56','Христина Христова',CONVERT(DATETIME, '23.11.2021', 104)),
    ('2021-11-17 00:00:00','Маша Малишкина',0881122678,'Шон Петерсон',0881555111,'Колетна пратка над 5 до 10 кг',10.75,'Силвия Бонева',0876555666,'ул. Ивайло 15','Лиляна Павлова',CONVERT(DATETIME, '23.11.2021', 104)),
    ('2021-11-22 00:00:00','Колю Колев',0888987555,'Стамен Киров',0883555246,'Колетна пратка над 5 до 10 кг',10.75,'Таня Руменова',0876555444,'ул. Блян, бл. 65','Стефан Колев',CONVERT(DATETIME, '26.11.2021', 104)),
    ('2021-11-24 00:00:00','Тодор Стоев',0889978555,'Нено Ненов',0888555666,'Колетна пратка до 2 кг',6,'Синтия Гочева',0876555888,'ул. Емил Гаванаков 25','Емилия Попова',CONVERT(DATETIME, '29.11.2021', 104)),
    ('2021-11-24 00:00:00','Колю Колев',0888987555,'Шон Петерсон',0881555111,'Колетна пратка до 2 кг',6,'Петър Иванов',0876555777,'ул. Ивайло 15','Лиляна Павлова',CONVERT(DATETIME, '30.11.2021', 104)),
    ('2021-11-30 00:00:00','Тодор Стоев',0889978555,'Стамен Киров',0883555246,'Колетна пратка над 5 до 10 кг',10.75,'Синтия Гочева',0876555888,'ул. Блян, бл. 65','Стефан Колев',CONVERT(DATETIME, '6.12.2021', 104)),
    ('2021-12-01 00:00:00','Тодор Стоев',0889978555,'Филип Филипов',0888555333,'Колетна пратка над 10 до 15 кг',12.1,'Таня Руменова',0876555444,'ул. Емил Гаванаков 5','Филип Филипополов',CONVERT(DATETIME, '6.12.2021', 104)),
    ('2021-12-07 00:00:00','Асен Донев',0887897555,'Христо Христов',0889555123,'Колетна пратка до 2 кг',6,'Калина Минкова',0876555333,'ул. Блян, бл. 56','Харалампи Харалампиев',CONVERT(DATETIME, '10.12.2021', 104)),
    ('2021-12-07 00:00:00','Тодор Стоев',0889978555,'Севинч Халилова',0888999567,'Колетна пратка над 2 до 5 кг',6.72,'Мони Иванова',0876555222,'ул. Иван Янев 65','Хамид Хамид',CONVERT(DATETIME, '10.12.2021', 104)),
    ('2021-12-08 00:00:00','Тодор Стоев',0889978555,'Нено Ненов',0888555666,'Колетна пратка над 2 до 5 кг',6.72,'Калина Минкова',0876555333,'ул. Лебед 7','Тино Ненов',CONVERT(DATETIME, '14.12.2021', 104)),
    ('2021-12-10 00:00:00','Тодор Стоев',0889978555,'Светлин Манев',0889245543,'Колетна пратка над 5 до 10 кг',10.75,'Силвия Бонева',0876555666,'ул. Иван Троянски 22','Иван Троянов',CONVERT(DATETIME, '15.12.2021', 104)),
    ('2021-12-13 00:00:00','Асен Донев',0887897555,'Светлин Манев',0889245543,'Колетна пратка над 10 до 15 кг',12.1,'Силвия Бонева',0876555666,'ул. Иван Владиков 23','Иван Василев',CONVERT(DATETIME, '17.12.2021', 104)),
    ('2021-12-15 00:00:00','Асен Донев',0887897555,'Нено Ненов',0888555666,'Колетна пратка над 5 до 10 кг',10.75,'Таня Руменова',0876555444,'ул. Дядо Димитър 16','Димитър Димитров',CONVERT(DATETIME, '21.12.2021', 104)),
    ('2021-12-17 00:00:00','Петър Петров',0882898666,'Нено Ненов',0888555666,'Колетна пратка над 2 до 5 кг',6.72,'Димана Донева',0876555555,'ул. Дядо Димитър 16','Димитър Димитров',CONVERT(DATETIME, '22.12.2021', 104)),
    ('2021-12-20 00:00:00','Теа Иванова',0883567555,'Светлин Манев',0889245543,'Колетна пратка до 2 кг',6,'Силвия Бонева',0876555666,'ул. Иван Троянски 22','Иван Троянов',CONVERT(DATETIME, '23.12.2021', 104)),
    ('2021-12-20 00:00:00','Маша Малишкина',0881122678,'Кирил Занев',0888666111,'Колетна пратка над 2 до 5 кг',6.72,'Калина Минкова',0876555333,'ул. Зограф 6','Борислава Борисова',CONVERT(DATETIME, '24.12.2021', 104)),
    ('2021-12-23 00:00:00','Теа Иванова',0883567555,'Нено Ненов',0888555666,'Колетна пратка над 5 до 10 кг',10.75,'Камен Каменов',0876555111,'ул. Лебед 7','Тино Ненов',CONVERT(DATETIME, '29.12.2021', 104)),
    ('2021-12-27 00:00:00','Колю Колев',0888987555,'Нено Ненов',0888555666,'Колетна пратка до 2 кг',6,'Мони Иванова',0876555222,'ул. Дядо Димитър 16','Ненчо Ненов',CONVERT(DATETIME, '31.12.2021', 104)),
    ('2021-12-27 00:00:00','Петър Петров',0882898666,'Светлин Манев',0889245543,'Колетна пратка над 5 до 10 кг',10.75,'Силвия Бонева',0876555666,'ул. Иван Троянски 22','Ива Иванова',CONVERT(DATETIME, '31.12.2021', 104)),
    ('2021-12-30 00:00:00','Колю Колев',0888987555,'Христо Иванов',0777555111,'Колетна пратка над 10 до 15 кг',12.1,'Камен Каменов',0876555111,'ул. Божур 9','Иван Христов',CONVERT(DATETIME, '5.1.2022', 104)),
    ('2021-12-31 00:00:00','Петър Петров',0882898666,'Христо Иванов',0777555111,'Колетна пратка над 2 до 5 кг',6.72,'Камен Каменов',0876555111,'ул. Божур 9','Иван Христов',CONVERT(DATETIME, '6.1.2022', 104));
INSERT INTO Orders
SELECT OrderDate, RecieveDate, Total,
	(SELECT ID
	FROM Addresses
	WHERE Addresses.Address = Orders_Temp.Address),
	(SELECT ID
	FROM TypesOfService
	WHERE TypesOfService.Type = Orders_Temp.ToS),
	(SELECT ID
	FROM Dispatchers
	WHERE Dispatchers.Name = Orders_Temp.Disp_Name AND Dispatchers.PhoneNumber = '0' + Orders_Temp.Disp_PN),
	(SELECT ID
	FROM Clients
	WHERE Clients.Name = Orders_Temp.Client_Name AND Clients.PhoneNumber = '0' + Orders_Temp.Client_PN),
	(SELECT ID
	FROM Couriers
	WHERE Couriers.Name = Orders_Temp.Cour_Name AND Couriers.PhoneNumber = '0' + Orders_Temp.Cour_PN),
	(SELECT ID
	FROM Recipients
	WHERE Recipients.Name = Orders_Temp.Recip_Name)
FROM Orders_Temp;
GO

DROP TABLE Orders_Temp;
GO

use master
go