use CouriersDB
go

CREATE TABLE Recipients_Temp (
    Name VARCHAR(50)
);
INSERT INTO Recipients_Temp VALUES
    ('Галена Халиева'),
    ('Шон Джим'),
    ('Шон Джим'),
    ('Христо Галев'),
    ('Зарко Борисов'),
    ('Зарко Борисов'),
    ('Огнян Руменов'),
    ('Петко Петков'),
    ('Сиси Бонева'),
    ('Петко Петков'),
    ('Васил Ставрев'),
    ('Харалампи Харалампиев'),
    ('Безис Абрамян'),
    ('Драган Драганов'),
    ('Лиляна Павлова'),
    ('Христина Христова'),
    ('Лиляна Павлова'),
    ('Стефан Колев'),
    ('Емилия Попова'),
    ('Лиляна Павлова'),
    ('Стефан Колев'),
    ('Филип Филипополов'),
    ('Харалампи Харалампиев'),
    ('Хамид Хамид'),
    ('Тино Ненов'),
    ('Иван Троянов'),
    ('Иван Василев'),
    ('Димитър Димитров'),
    ('Димитър Димитров'),
    ('Иван Троянов'),
    ('Борислава Борисова'),
    ('Тино Ненов'),
    ('Ненчо Ненов'),
    ('Ива Иванова'),
    ('Иван Христов'),
    ('Иван Христов');
INSERT INTO Recipients
SELECT DISTINCT Name FROM Recipients_Temp;
GO

DROP TABLE Recipients_Temp;
GO

use master
go