use CouriersDB
go

CREATE TABLE TypesOfService_Temp (
    ToS VARCHAR(50)
);
INSERT INTO TypesOfService_Temp VALUES
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка над 10 до 15 кг'),
    ('Колетна пратка над 10 до 15 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 5 до 10 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 10 до 15 кг'),
    ('Колетна пратка над 10 до 15 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 10 до 15 кг'),
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка над 5 до 10 кг'),
    ('Колетна пратка над 5 до 10 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 5 до 10 кг'),
    ('Колетна пратка над 10 до 15 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка над 5 до 10 кг'),
    ('Колетна пратка над 10 до 15 кг'),
    ('Колетна пратка над 5 до 10 кг'),
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 2 до 5 кг'),
    ('Колетна пратка над 5 до 10 кг'),
    ('Колетна пратка до 2 кг'),
    ('Колетна пратка над 5 до 10 кг'),
    ('Колетна пратка над 10 до 15 кг'),
    ('Колетна пратка над 2 до 5 кг');
INSERT INTO TypesOfService
SELECT DISTINCT ToS FROM TypesOfService_Temp;
GO

DROP TABLE TypesOfService_Temp;
GO


use master
go